; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 7534)
	(= (fuel plane1) 1841)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city1)
	(= (capacity plane2) 8950)
	(= (fuel plane2) 2533)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city0)
	(= (capacity plane3) 6361)
	(= (fuel plane3) 2371)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city0)
	(= (capacity plane4) 3041)
	(= (fuel plane4) 550)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at person1 city0)
	(at person2 city0)
	(at person3 city4)
	(at person4 city4)
	(at person5 city1)
	(at person6 city3)
	(at person7 city2)
	(at person8 city4)
	(at person9 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 657)
	(= (distance city0 city2) 642)
	(= (distance city0 city3) 620)
	(= (distance city0 city4) 742)
	(= (distance city1 city0) 657)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 687)
	(= (distance city1 city3) 526)
	(= (distance city1 city4) 785)
	(= (distance city2 city0) 642)
	(= (distance city2 city1) 687)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 985)
	(= (distance city2 city4) 757)
	(= (distance city3 city0) 620)
	(= (distance city3 city1) 526)
	(= (distance city3 city2) 985)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 714)
	(= (distance city4 city0) 742)
	(= (distance city4 city1) 785)
	(= (distance city4 city2) 757)
	(= (distance city4 city3) 714)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city1)
	(at person1 city2)
	(at person2 city4)
	(at person3 city2)
	(at person4 city0)
	(at person5 city4)
	(at person6 city1)
	(at person7 city3)
	(at person8 city3)
	(at person9 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (board person5 plane2 city1)
   deleted: (at person5 city1)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
2. (fly plane2 city1 city4)
   deleted: (at plane2 city1)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 2355, (fuel plane2) from 2533 to 178
   goals met: 0 of 10
3. (board person1 plane3 city0)
   deleted: (at person1 city0)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 10
4. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 0 of 10
5. (board person8 plane2 city4)
   deleted: (at person8 city4)
   added: (in person8 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 10
6. (debark person5 plane2 city4)
   deleted: (in person5 plane2)
   added: (at person5 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 1 of 10
7. (refuel plane2 city4)
   changed: (fuel plane2) from 178 to 8950
   goals met: 1 of 10
8. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 2355 to 4497, (fuel plane2) from 8950 to 6808
   goals met: 1 of 10
9. (debark person8 plane2 city3)
   deleted: (in person8 plane2)
   added: (at person8 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 10
10. (board person6 plane2 city3)
   deleted: (at person6 city3)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 10
11. (board person9 plane1 city2)
   deleted: (at person9 city2)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
12. (refuel plane1 city2)
   changed: (fuel plane1) from 1841 to 7534
   goals met: 2 of 10
13. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 10
14. (zoom plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 4497 to 9231, (fuel plane2) from 6808 to 2074
   goals met: 3 of 10
15. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 10
16. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 9231 to 12186, (fuel plane1) from 7534 to 4579
   goals met: 4 of 10
17. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 10
18. (fly plane3 city0 city4)
   deleted: (at plane3 city0)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 12186 to 14412, (fuel plane3) from 2371 to 145
   goals met: 5 of 10
19. (refuel plane3 city4)
   changed: (fuel plane3) from 145 to 6361
   goals met: 5 of 10
20. (debark person2 plane3 city4)
   deleted: (in person2 plane3)
   added: (at person2 city4)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 10
21. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
22. (board person3 plane3 city4)
   deleted: (at person3 city4)
   added: (in person3 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 7 of 10
23. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 7 of 10
24. (fly plane3 city4 city2)
   deleted: (at plane3 city4)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 14412 to 16683, (fuel plane3) from 6361 to 4090
   goals met: 7 of 10
25. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   changed: (onboard plane3) from 3 to 2
   goals met: 8 of 10
26. (debark person3 plane3 city2)
   deleted: (in person3 plane3)
   added: (at person3 city2)
   changed: (onboard plane3) from 2 to 1
   goals met: 9 of 10
27. (fly plane3 city2 city0)
   deleted: (at plane3 city2)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 16683 to 18609, (fuel plane3) from 4090 to 2164
   goals met: 9 of 10
28. (debark person4 plane3 city0)
   deleted: (in person4 plane3)
   added: (at person4 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 10 of 10
